<?php 
include '../config/dbc.php';

page_protect();


$pin = mysqli_query($link, "SELECT * FROM acnumber");
while($ch = mysqli_fetch_array($pin))
{
    $id = $ch['ac_no'];
    $acin = $ch['ac_no'];
    /*
    		1000 สินทรัพย์
		1001 เงินสด
		1002-1020 ธนาคาร
		1021-1030 อาคาร และ ที่ดิน 
		1500-1999 ลูกหนี้ทั่วไป
		10000-15000 วอ.แพทย์
		15001-19999 อ.สำนักงาน
		100000-179999 สินค้า
		180000-189999 วัตถุดิบ
		1000000-1999999 ลูกหนี้ คนไข้ค้างชำระ


		2000 เจ้าหนี้
		2000-2100 เจ้าหนี้ อื่นๆ
		2101-2999 เจ้าหนี้ ซื้อ ยา และ อุปกรณ์

		3000 ทุน
		3001-3499 ทุน ผู้ร่วมทุน
		3500-3999 ทุน คืน กำไร

		4000 รายได้รับ รายได้จากการขาย
		4001-4999 รายได้อื่นๆ

		5000 รายจ่าย
		5002-5020 ธนาคาร ค่าธรรมเนียม
		5021-5550 รายจ่ายต่างๆ
		5551-5998 ว.สำนักงาน ตัดเป็นค่าใช่จ่ายเลย
		50000-55000  ค่าเสื่อมราคา วอ.แพทย์ หักเป็นค่าใช้จ่าย 
		55001-59999 ค่าเสื่อมราคา อ.สำนักงาน หักเป็นค่าใช้จ่าย 
		5999 ตัดยอด
*/
       /* 
            10000000 สินทรัพย์
            10000001 เงินสด
            10000002-10000249 ธนาคาร
            10000250-10003999 อาคาร และ ที่ดิน สินทรัพย์อื่นๆ
            10004000-10009999 ลูกหนี้ทั่วไป
            10010000-10099999 วอ.แพทย์
            10100000-10299999 อ.สำนักงาน
            10300000-10699999 สินค้า 10300000 ตัดยอด//start with 10300000 + drug_id
            10700000-10999999 วัตถุดิบ 10700000 ตัดยอด //start with 10700000 + rawmat_id
            11000001-19999999 ลูกหนี้ คนไข้ค้างชำระ  //start with 11000000 + pt_id


            20000000 เจ้าหนี้
            20000001-20199999 เจ้าหนี้ เงินกู้
            21000001-29999999 เจ้าหนี้ ซื้อ ยา และ อุปกรณ์ //start with 21000000 + sp_id

            30000000 ทุน
            30000001-34999999 ทุน ผู้ร่วมทุน
            35000001-39999999 ทุน คืน กำไร

            40000000 รายได้รับ
            40000001 รายได้จากการขาย
            40000002-40000249 ดอกเบี้ยรับธนาคาร
            40000250-49999999 รายได้อื่นๆ

            50000000 รายจ่าย
            50000001 หนี้สูญ-จ่าย
            50000002-50000249 ธนาคาร ค่าธรรมเนียม
            50000250-50002999 รายจ่ายต่างๆ
            50003000-50009999 ว.สำนักงาน ตัดเป็นค่าใช่จ่ายเลย
            50010000-50099999  ค่าเสื่อมราคา วอ.แพทย์ หักเป็นค่าใช้จ่าย 
            50100000-50299999 ค่าเสื่อมราคา อ.สำนักงาน หักเป็นค่าใช้จ่าย 
            51000000-59999998 เงินเดือน จ่าย 51000000 for non staff payment //start with 51000000 + staff_id
            59999999 ตัดยอด
        */	
    if($acin>=1000 and $acin<=1020){ $acin = $acin - 1000 +10000000;}//1001 เงินสด1002-1020 ธนาคาร  10000001 เงินสด 10000002-10000249 ธนาคาร
    elseif($acin>=1021 and $acin<=1030){ $acin = $acin - 1020 +10000250;}//1021-1030 อาคาร และ ที่ดิน 10000250-10003999 อาคาร และ ที่ดิน สินทรัพย์อื่นๆ
    elseif($acin>=1500 and $acin<=1999){ $acin = $acin - 1500 +10004000;}//1500-1999 ลูกหนี้ทั่วไป 10004000-10009999 ลูกหนี้ทั่วไป
    elseif($acin>=10000 and $acin<=15000){ $acin = $acin - 10000 +10010000;}//10000-15000 วอ.แพทย์  10010000-10099999 วอ.แพทย์
    elseif($acin>=15001 and $acin<=19999){ $acin = $acin - 15000 +10100000;}//15001-19999 อ.สำนักงาน 10100000-10299999 อ.สำนักงาน
    elseif($acin>=100000 and $acin<=179999){ $acin = $acin - 100000 +10300000;}//100000-179999 สินค้า 10300000-10699999 สินค้า 10300000 ตัดยอด//start with 10300000 + drug_id
    elseif($acin>=180000 and $acin<=189999){ $acin = $acin - 180000 +10700000;}//180000-189999 วัตถุดิบ  10700000-10999999 วัตถุดิบ 10700000 ตัดยอด //start with 10700000 + rawmat_id
    elseif($acin>=1000000 and $acin<=1999999){ $acin = $acin - 1000000 +11000000;}//1000000-1999999 ลูกหนี้ คนไข้ค้างชำระ 11000001-19999999 ลูกหนี้ คนไข้ค้างชำระ  //start with 11000000 + pt_id
    elseif($acin>=2000 and $acin<=2100){ $acin = $acin - 2000 +20000000;}//2000-2100 เจ้าหนี้ อื่นๆ 20000001-20199999 เจ้าหนี้ เงินกู้
    elseif($acin>=2101 and $acin<=2999){ $acin = $acin - 2100 +21000000;}//2101-2999 เจ้าหนี้ ซื้อ ยา และ อุปกรณ์ 21000001-29999999 เจ้าหนี้ ซื้อ ยา และ อุปกรณ์ //start with 21000000 + sp_id
    elseif($acin>=3000 and $acin<=3499){ $acin = $acin - 3000 +30000000;}//3001-3499 ทุน ผู้ร่วมทุน 30000001-34999999 ทุน ผู้ร่วมทุน
    elseif($acin>=3500 and $acin<=3999){ $acin = $acin - 3500 +35000000;}//3500-3999 ทุน คืน กำไร 35000001-39999999 ทุน คืน กำไร
    elseif($acin>=5002 and $acin<=5020){ $acin = $acin - 5000 +50000000;}//5002-5020 ธนาคาร ค่าธรรมเนียม 50000002-50000249 ธนาคาร ค่าธรรมเนียม
    elseif($acin>=5021 and $acin<=5550){ $acin = $acin - 5020 +50000250;}//5021-5550 รายจ่ายต่างๆ  50000250-50002999 รายจ่ายต่างๆ
    elseif($acin>=5551 and $acin<=5997){ $acin = $acin - 5550 +50003000;}//5551-5998 ว.สำนักงาน ตัดเป็นค่าใช่จ่ายเลย 50003000-50009999 ว.สำนักงาน ตัดเป็นค่าใช่จ่ายเลย
    elseif($acin>=50000 and $acin<=55000){ $acin = $acin - 50000 +50010000;}//50000-55000  ค่าเสื่อมราคา วอ.แพทย์ หักเป็นค่าใช้จ่าย   50010000-50099999  ค่าเสื่อมราคา วอ.แพทย์ หักเป็นค่าใช้จ่าย 
    elseif($acin>=55000 and $acin<=59999){ $acin = $acin - 55000 +50100000;}//55001-59999 ค่าเสื่อมราคา อ.สำนักงาน หักเป็นค่าใช้จ่าย   50100000-50299999 ค่าเสื่อมราคา อ.สำนักงาน หักเป็นค่าใช้จ่าย 
    elseif($acin==5999){ $acin = 59999999;}//5999 ตัดยอด 59999999 ตัดยอด
    elseif($acin==5998){ $acin = 50000001;}//5998 ตัดยอดหน้้สูญ 50000001 หนี้สูญ-จ่าย
    elseif($acin==4000){ $acin = 40000001; }//4000 รายได้รับ รายได้จากการขาย 40000001 รายได้จากการขาย
    elseif($acin>=4001 and $acin<=4999){ $acin = $acin-4000 +40000250; }//4001-4999 รายได้อื่นๆ 40000002-40000249 ดอกเบี้ยรับธนาคาร 40000250-49999999 รายได้อื่นๆ
    
    $updateac = "UPDATE `acnumber` SET  `ac_no` = '$acin' WHERE `ac_no` ='$id' LIMIT 1 ; ";
    $newac = mysqli_query($link, $updateac);
}
?>
<!DOCTYPE html>
<html>
<head>
<title>ประวัติ ตรวจร่างกาย</title>
<meta content="text/html; charset=utf-8" http-equiv="content-type">
<link href="styles.css" rel="stylesheet" type="text/css">
</head>
<body>
<div id="content">
<div style="text-align: center;">acnumber finish
</div>
<!--end menu-->
</div>
</body>
</html>
